---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ArrayFailures
source: html/a8efa8dc-7028-5cd0-a41b-44fbe06ad0d6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ArrayFailures

Failures about Arrays.

## Syntax (C#)
```csharp
public static class ArrayFailures
```